zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_LPUART.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K312_LPUART.h
 * @version 1.4
 * @date 2022-06-20
 * @brief Peripheral Access Layer for S32K312_LPUART
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K312_LPUART_H_)  /* Check if memory map has not been already included */
#define S32K312_LPUART_H_

#include "S32K312_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPUART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Peripheral_Access_Layer LPUART Peripheral Access Layer
 * @{
 */

/** LPUART - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID Register, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter Register, offset: 0x4 */
  __IO uint32_t GLOBAL;                            /**< LPUART Global Register, offset: 0x8 */
  __IO uint32_t PINCFG;                            /**< LPUART Pin Configuration Register, offset: 0xC */
  __IO uint32_t BAUD;                              /**< LPUART Baud Rate Register, offset: 0x10 */
  __IO uint32_t STAT;                              /**< LPUART Status Register, offset: 0x14 */
  __IO uint32_t CTRL;                              /**< LPUART Control Register, offset: 0x18 */
  __IO uint32_t DATA;                              /**< LPUART Data Register, offset: 0x1C */
  __IO uint32_t MATCH;                             /**< LPUART Match Address Register, offset: 0x20 */
  __IO uint32_t MODIR;                             /**< LPUART Modem IrDA Register, offset: 0x24 */
  __IO uint32_t FIFO;                              /**< LPUART FIFO Register, offset: 0x28 */
  __IO uint32_t WATER;                             /**< LPUART Watermark Register, offset: 0x2C */
  __I  uint32_t DATARO;                            /**< Data read-only Register, offset: 0x30 */
} LPUART_Type, *LPUART_MemMapPtr;

/** Number of instances of the LPUART module. */
#define LPUART_INSTANCE_COUNT                    (8u)

/* LPUART - Peripheral instance base addresses */
/** Peripheral LPUART_0 base address */
#define IP_LPUART_0_BASE                         (0x40328000u)
/** Peripheral LPUART_0 base pointer */
#define IP_LPUART_0                              ((LPUART_Type *)IP_LPUART_0_BASE)
/** Peripheral LPUART_1 base address */
#define IP_LPUART_1_BASE                         (0x4032C000u)
/** Peripheral LPUART_1 base pointer */
#define IP_LPUART_1                              ((LPUART_Type *)IP_LPUART_1_BASE)
/** Peripheral LPUART_2 base address */
#define IP_LPUART_2_BASE                         (0x40330000u)
/** Peripheral LPUART_2 base pointer */
#define IP_LPUART_2                              ((LPUART_Type *)IP_LPUART_2_BASE)
/** Peripheral LPUART_3 base address */
#define IP_LPUART_3_BASE                         (0x40334000u)
/** Peripheral LPUART_3 base pointer */
#define IP_LPUART_3                              ((LPUART_Type *)IP_LPUART_3_BASE)
/** Peripheral LPUART_4 base address */
#define IP_LPUART_4_BASE                         (0x40338000u)
/** Peripheral LPUART_4 base pointer */
#define IP_LPUART_4                              ((LPUART_Type *)IP_LPUART_4_BASE)
/** Peripheral LPUART_5 base address */
#define IP_LPUART_5_BASE                         (0x4033C000u)
/** Peripheral LPUART_5 base pointer */
#define IP_LPUART_5                              ((LPUART_Type *)IP_LPUART_5_BASE)
/** Peripheral LPUART_6 base address */
#define IP_LPUART_6_BASE                         (0x40340000u)
/** Peripheral LPUART_6 base pointer */
#define IP_LPUART_6                              ((LPUART_Type *)IP_LPUART_6_BASE)
/** Peripheral LPUART_7 base address */
#define IP_LPUART_7_BASE                         (0x40344000u)
/** Peripheral LPUART_7 base pointer */
#define IP_LPUART_7                              ((LPUART_Type *)IP_LPUART_7_BASE)
/** Array initializer of LPUART peripheral base addresses */
#define IP_LPUART_BASE_ADDRS                     { IP_LPUART_0_BASE, IP_LPUART_1_BASE, IP_LPUART_2_BASE, IP_LPUART_3_BASE, IP_LPUART_4_BASE, IP_LPUART_5_BASE, IP_LPUART_6_BASE, IP_LPUART_7_BASE }
/** Array initializer of LPUART peripheral base pointers */
#define IP_LPUART_BASE_PTRS                      { IP_LPUART_0, IP_LPUART_1, IP_LPUART_2, IP_LPUART_3, IP_LPUART_4, IP_LPUART_5, IP_LPUART_6, IP_LPUART_7 }

/* ----------------------------------------------------------------------------
   -- LPUART Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Register_Masks LPUART Register Masks
 * @{
 */

